### Brewfile packages

# Replace OSX binaries with GNU binaries.
brew 'autoconf'
brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'flex'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gpatch'
brew 'gnutls'
brew 'grep'
brew 'gzip'
brew 'htop'
brew 'less'
brew 'm4'
brew 'make'
brew 'nano'
brew 'screen'
brew 'tree'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'zip'
brew 'unzip'
brew 'zsh'

# OS X ships a GNU version, but too old
brew 'bash'
brew 'bash-completion@2'
brew 'emacs'
brew 'gpatch'
brew 'm4'
brew 'vim'

# Fonts
cask 'font-jetbrains-mono-nerd-font'

# Other commands
brew 'file-formula'
brew 'fzf'
brew 'fastfetch'
brew 'ripgrep'
brew 'bat'
brew 'btop'
brew 'eza'
brew 'zoxide'
brew 'tlrc'
brew 'neovim'
brew 'tree-sitter'
brew 'git'
brew 'less'
brew 'mas'
brew 'node'
brew 'go'
brew 'openssh'
brew 'perl'
brew 'python'
brew 'python3'
brew 'pipx'
brew 'p7zip'
brew 'rsync'
brew 'svn'
brew 'unzip'
brew 'rust'
brew 'rustup'
brew 'stow'
brew 'rename'
brew 'jq'
brew 'rlwrap'

