### Brewfile terminal packages

# brew 'abcde'
brew 'autoconf'
brew 'bash-completion@2'
brew 'bash'
brew 'bat'
brew 'binutils'
brew 'btop'
brew 'coreutils'
brew 'curl'
brew 'curlie'
brew 'diffutils'
brew 'ed'
brew 'emacs'
brew 'eza'
brew 'fastfetch'
brew 'fd'
brew 'ffmpeg'
brew 'file-formula'
brew 'findutils'
brew 'fish'
brew 'flex'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'glow'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gpatch'
brew 'grep'
brew 'gzip'
brew 'hledger'
brew 'htop'
brew 'jj'
brew 'jq'
brew 'ledger'
brew 'less'
brew 'lsd'
brew 'lua'
brew 'luarocks'
brew 'm4'
brew 'make'
brew 'markdown-toc'
brew 'markdownlint-cli2'
brew 'mas'
brew 'mise'
brew 'nano'
brew 'neovim'
brew 'nushell'
brew 'openssh'
brew 'p7zip'
brew 'perl'
brew 'pipx'
brew 'posting'
brew 'prettier'
brew 'python'
brew 'python3'
brew 'rename'
brew 'ripgrep'
brew 'rlwrap'
brew 'rsync'
brew 'scdl' # Soundcloud dowloader
brew 'screen'
brew 'sqlfluff'
brew 'starship'
brew 'stow'
brew 'svn'
brew 'tlrc'
brew 'tree-sitter'
brew 'tree'
brew 'unzip'
brew 'uv'
brew 'vim'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'xh'
brew 'yazi'
brew 'ykman' # For managing Yubikeys
brew 'yt-dlp' # Youtube dowloader
brew 'zip'
brew 'zoxide'
brew 'zsh'
