### Brewfile for desktop applications

cask 'adobe-acrobat-reader'
cask 'alacritty' # My preferred terminal emulator
cask 'alfred' # A powerful spotlight replacement
cask 'brave-browser' # A privacy focused browser. You can use this for Tor btw.
cask 'discord'
cask 'element' # Open source, decentralized, E2E encrypted discord alternative
cask 'firefox'
cask 'flameshot'
cask 'gifox' # screen record gifs
cask 'google-chrome'
cask 'gpg-suite' # PGP tools
cask 'hammerspoon'
cask 'iterm2' # How many terminals do we really need
cask 'karabiner-elements' # I use this to disable the trackpad/keyboard when I have an external plugged in
cask 'keepassxc' # Password manager
cask 'keka' # Better archiver than default
cask 'kekaexternalhelper'
cask 'libreoffice' # Office suite
cask 'localsend'
cask 'macfuse'
cask 'obsidian' # Absurdly powerful knowledge archiver
cask 'pinta'
cask 'rectangle' # Move and resize windows at ease.
cask 'retroarch'
cask 'sdformatter' # Format SD cards properly
cask 'signal' # Open source E2E encrypted messenger. The BEST.
cask 'slack' # Not everyone uses discord
cask 'spotify'
cask 'steam' # What, YOU DON'T GAME?
cask 'typora'
cask 'veracrypt' # File encryption
cask 'vlc' # Media player. Supports everything
cask 'yubico-authenticator' # For managing Yubikeys
brew 'zellij' # Modern Tmux style session manager for terminal
