# Brewfile packages

# Developer apps

brew 'asciinema' # easily record terminal sessions to animated gifs
brew 'docker-completion'
brew 'docker-compose'
brew 'docker'
cask 'flutter'
brew 'gron' # Make JSON greppable
cask 'insomnia' # API tools
brew 'kubernetes-cli'
brew 'minikube'
brew 'mise'
cask 'postman' # API tools
brew 'ttyd'
cask 'utm' # Run MacOS Virtual machines
cask 'windsurf'
cask 'zed'
brew 'vhs' # Terminal video recorder
cask 'virtualbox'
cask 'visual-studio-code' # VSCode IDE
